snech99/Clock_Robot/src/Robotik_V4_ext/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MCXA153
package_id: MCXA153VLH
mcu_data: ksdk2_0
processor_version: 15.0.0
board: FRDM-MCXA153
external_user_signals: {}
pin_labels:
- {pin_num: '1', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/ADC0_A23, label: 'P1_7/J1[1]', identifier: SW3;HOMING}
- {pin_num: '2', pin_signal: P1_8/WUU0_IN10/LPUART1_RXD/LPI2C0_SDA/CT_INP8/CT0_MAT2/I3C0_SDA, label: 'P1_8/J2[18]', identifier: UART_1_RX}
- {pin_num: '3', pin_signal: P1_9/LPUART1_TXD/LPI2C0_SCL/CT_INP9/CT0_MAT3/I3C0_SCL, label: 'P1_9/J2[20]', identifier: UART_1_TX}
- {pin_num: '4', pin_signal: P1_10/LPUART1_RTS_B/LPI2C0_SDAS/CT2_MAT0/ADC0_A8, label: 'P1_10/J4[2]', identifier: PWM_DIR_2;PWM_DIR_TEST;Home;HOME}
- {pin_num: '5', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C0_SCLS/CT2_MAT1/I3C0_PUR/ADC0_A9, label: 'P1_11/TP5/J4[9]', identifier: HOMING_TEST}
- {pin_num: '6', pin_signal: P1_12/WUU0_IN12/LPUART2_RXD/CT2_MAT2/ADC0_A10, label: 'P1_12/J4[4]', identifier: PWM_DIR_3;SW1}
- {pin_num: '7', pin_signal: P1_13/TRIG_IN3/LPUART2_TXD/CT2_MAT3/ADC0_A11, label: 'P1_13/J4[6]', identifier: PWM_DIR_;PWM_DIR_1;SW2}
- {pin_num: '14', pin_signal: P2_0/WUU0_IN18/TRIG_IN6/LPUART0_RXD/CT_INP16/CT2_MAT0/ADC0_A0, label: 'P2_0/J4[8]', identifier: PWM_DIR_0;RAMP_COUNTER}
- {pin_num: '17', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/ADC0_A2/CMP1_IN0, label: 'P2_3/J2[5]', identifier: DIR_AXIS}
- {pin_num: '18', pin_signal: P2_4/CT_INP14/CT1_MAT0, label: 'P2_4/J1[6]/J7[12]', identifier: ENDSTOP_2;PWM;PWM_CLEAR_OUT}
- {pin_num: '19', pin_signal: P2_5/CT_INP15/CT1_MAT1, label: 'P2_5/J1[10]/J5[2]', identifier: ENDSTOP_1}
- {pin_num: '20', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/CT_INP18/CT1_MAT2/ADC0_A3, label: 'P2_6/J2[6]', identifier: ENDSTOP_0;ENDSTOP_STICK}
- {pin_num: '22', pin_signal: P2_12/WUU0_IN20/USB0_VBUS_DET/LPSPI1_SCK/LPUART1_RXD/CT0_MAT0/ADC0_A5, label: 'P2_12/J2[12]', identifier: ENDSTOP_1;ENDSTOP_AXIS}
- {pin_num: '23', pin_signal: P2_13/TRIG_IN8/LPSPI1_SDO/LPUART1_TXD/CT0_MAT1, label: 'P2_13/J2[8]', identifier: ENDSTOP_TOWER}
- {pin_num: '24', pin_signal: P2_16/LPSPI1_SDI/LPUART1_RTS_B/CT0_MAT2/ADC0_A6, label: 'P2_16/J2[10]', identifier: ENDSTOP_CLEAR}
- {pin_num: '35', pin_signal: P3_15/LPUART2_TXD/CT_INP7, label: 'P3_15/J2[2]/J5[4]', identifier: ENDSTOP_3;DIR_3;DIR_CLEAR}
- {pin_num: '36', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/CT_INP6/PWM0_X2, label: 'P3_14/J2[4]/J5[3]', identifier: DIR_2;DIR_AXIS;DIR_TOWER}
- {pin_num: '40', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2, label: 'P3_10/J3[7]', identifier: PWM_A_2_PIN;PWM_AXIS_PIN;PWM_TOWER_PIN;PWM_TOWER_OUT}
- {pin_num: '42', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/CLKOUT, label: 'P3_8/J3[11]', identifier: PWM_A_1_PIN;PWM_TOWER_PIN;PWM_AXIS_PIN;PWM_AXIS_OUT}
- {pin_num: '44', pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/PWM0_A0/FREQME_CLK_OUT1, label: 'P3_6/J3[15]', identifier: PWM_A_0_PIN;PWM_A_STICK_PIN;PW_STICK_PIN;PWM_STICK_PIN;PWM_STICK_OUT}
- {pin_num: '45', pin_signal: P3_1/TRIG_IN1/CT_INP17/PWM0_B0/FREQME_CLK_OUT0, label: 'P3_1/J1[16]/J6[2]/J7[10]', identifier: ENDSTOP_0;DIR_0;DIR_STICK}
- {pin_num: '54', pin_signal: P0_16/WUU0_IN2/LPI2C0_SDA/LPSPI0_PCS2/CT0_MAT0/UTICK_CAP2/I3C0_SDA, label: 'P0_16/J20/U8[1]', identifier: UART_PAUSE}
- {pin_num: '62', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/ADC0_A20/CMP0_IN2, label: 'P1_4/J2[1]/J1[2]', identifier: UART_2_RX}
- {pin_num: '63', pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/ADC0_A21/CMP1_IN2, label: 'P1_5/J2[3]/J1[4]', identifier: UART_2_TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    Init_PWM();
    Init_UART();
    Init_CTIMER0();
    Init_CTIMER2();
    Init_DIR_STOP_PIN();
    Init_CTIMER1();
    Init_STATUS_LED();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Init_PWM:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: '44', peripheral: FlexPWM0, signal: 'A, 0', pin_signal: P3_6/CLKOUT/LPSPI1_PCS3/PWM0_A0/FREQME_CLK_OUT1, identifier: PWM_STICK_OUT, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '42', peripheral: FlexPWM0, signal: 'A, 1', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/CLKOUT, identifier: PWM_AXIS_OUT,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '40', peripheral: FlexPWM0, signal: 'A, 2', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2, identifier: PWM_TOWER_OUT, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

