snech99/Clock_Robot/src/Robotik_V4_ext/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Init_CTIMER2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Init_CTIMER2(void)
{
    /* Write to PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* CTIMER2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCTIMER2_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);

    const port_pin_config_t RAMP_COUNTER = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Low internal pull resistor value is selected. */
                                            kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            kPORT_NormalDriveStrength,
                                            /* Pin is configured as CT2_MAT0 */
                                            kPORT_MuxAlt5,
                                            /* Digital input enabled */
                                            kPORT_InputBufferEnable,
                                            /* Digital input is not inverted */
                                            kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORT2_0 (pin 14) is configured as CT2_MAT0 */
    PORT_SetPinConfig(INIT_CTIMER2_RAMP_COUNTER_PORT, INIT_CTIMER2_RAMP_COUNTER_PIN, &RAMP_COUNTER);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Init_DIR_STOP_PIN:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: GPIO1, signal: 'GPIO, 10', pin_signal: P1_10/LPUART1_RTS_B/LPI2C0_SDAS/CT2_MAT0/ADC0_A8, identifier: HOME, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: enable, input_buffer: enable, invert_input: normal}
  - {pin_num: '6', peripheral: GPIO1, signal: 'GPIO, 12', pin_signal: P1_12/WUU0_IN12/LPUART2_RXD/CT2_MAT2/ADC0_A10, identifier: SW1, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: enable, input_buffer: enable, invert_input: normal}
  - {pin_num: '7', peripheral: GPIO1, signal: 'GPIO, 13', pin_signal: P1_13/TRIG_IN3/LPUART2_TXD/CT2_MAT3/ADC0_A11, identifier: SW2, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: enable, input_buffer: enable, invert_input: normal}
  - {pin_num: '45', peripheral: GPIO3, signal: 'GPIO, 1', pin_signal: P3_1/TRIG_IN1/CT_INP17/PWM0_B0/FREQME_CLK_OUT0, identifier: DIR_STICK, direction: OUTPUT, gpio_init_state: 'false',
    slew_rate: fast, open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable,
    invert_input: normal}
  - {pin_num: '36', peripheral: GPIO3, signal: 'GPIO, 14', pin_signal: P3_14/WUU0_IN25/LPUART2_RXD/CT_INP6/PWM0_X2, identifier: DIR_TOWER, direction: OUTPUT, gpio_init_state: 'false',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '35', peripheral: GPIO3, signal: 'GPIO, 15', pin_signal: P3_15/LPUART2_TXD/CT_INP7, identifier: DIR_CLEAR, direction: OUTPUT, gpio_init_state: 'false',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '20', peripheral: GPIO2, signal: 'GPIO, 6', pin_signal: P2_6/TRIG_OUT4/LPSPI1_PCS1/CT_INP18/CT1_MAT2/ADC0_A3, identifier: ENDSTOP_STICK, direction: INPUT,
    gpio_per_interrupt: kGPIO_InterruptRisingEdge, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable,
    invert_input: normal}
  - {pin_num: '22', peripheral: GPIO2, signal: 'GPIO, 12', pin_signal: P2_12/WUU0_IN20/USB0_VBUS_DET/LPSPI1_SCK/LPUART1_RXD/CT0_MAT0/ADC0_A5, identifier: ENDSTOP_AXIS,
    direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable,
    input_buffer: enable, invert_input: normal}
  - {pin_num: '23', peripheral: GPIO2, signal: 'GPIO, 13', pin_signal: P2_13/TRIG_IN8/LPSPI1_SDO/LPUART1_TXD/CT0_MAT1, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '24', peripheral: GPIO2, signal: 'GPIO, 16', pin_signal: P2_16/LPSPI1_SDI/LPUART1_RTS_B/CT0_MAT2/ADC0_A6, direction: INPUT, gpio_per_interrupt: kGPIO_InterruptRisingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '17', peripheral: GPIO2, signal: 'GPIO, 3', pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/ADC0_A2/CMP1_IN0, direction: OUTPUT,
    gpio_init_state: 'false', slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

