snech99/Clock_Robot/src/Robotik_V4_ext/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Init_DIR_STOP_PIN
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Init_DIR_STOP_PIN(void)
{
    /* Write to GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* Write to GPIO2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO2);
    /* Write to GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* Write to PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* Write to PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO2_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

    gpio_pin_config_t HOME_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_10 (pin 4)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_HOME_GPIO, INIT_DIR_STOP_PIN_HOME_PIN, &HOME_config);

    gpio_pin_config_t SW1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_12 (pin 6)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_SW1_GPIO, INIT_DIR_STOP_PIN_SW1_PIN, &SW1_config);

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin 7)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_SW2_GPIO, INIT_DIR_STOP_PIN_SW2_PIN, &SW2_config);

    gpio_pin_config_t DIR_AXIS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_3 (pin 17)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_DIR_AXIS_GPIO, INIT_DIR_STOP_PIN_DIR_AXIS_PIN, &DIR_AXIS_config);

    gpio_pin_config_t ENDSTOP_STICK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_6 (pin 20)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_ENDSTOP_STICK_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_STICK_PIN, &ENDSTOP_STICK_config);

    gpio_pin_config_t ENDSTOP_AXIS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_12 (pin 22)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_ENDSTOP_AXIS_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_AXIS_PIN, &ENDSTOP_AXIS_config);

    gpio_pin_config_t ENDSTOP_TOWER_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_13 (pin 23)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_ENDSTOP_TOWER_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_TOWER_PIN, &ENDSTOP_TOWER_config);

    gpio_pin_config_t ENDSTOP_CLEAR_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_16 (pin 24)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_PIN, &ENDSTOP_CLEAR_config);

    gpio_pin_config_t DIR_STICK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_1 (pin 45)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_DIR_STICK_GPIO, INIT_DIR_STOP_PIN_DIR_STICK_PIN, &DIR_STICK_config);

    gpio_pin_config_t DIR_TOWER_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_14 (pin 36)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_DIR_TOWER_GPIO, INIT_DIR_STOP_PIN_DIR_TOWER_PIN, &DIR_TOWER_config);

    gpio_pin_config_t DIR_CLEAR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_15 (pin 35)  */
    GPIO_PinInit(INIT_DIR_STOP_PIN_DIR_CLEAR_GPIO, INIT_DIR_STOP_PIN_DIR_CLEAR_PIN, &DIR_CLEAR_config);

    /* Interrupt configuration on GPIO1_10 (pin 4): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_HOME_GPIO, INIT_DIR_STOP_PIN_HOME_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIO1_12 (pin 6): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_SW1_GPIO, INIT_DIR_STOP_PIN_SW1_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIO1_13 (pin 7): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_SW2_GPIO, INIT_DIR_STOP_PIN_SW2_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIO2_12 (pin 22): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_ENDSTOP_AXIS_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_AXIS_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIO2_13 (pin 23): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_ENDSTOP_TOWER_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_TOWER_PIN, kGPIO_InterruptRisingEdge);

    /* Interrupt configuration on GPIO2_16 (pin 24): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_PIN, kGPIO_InterruptRisingEdge);

