snech99/Clock_Robot/src/Robotik_V4_ext/board/pin_mux.c
    /* Interrupt configuration on GPIO2_6 (pin 20): Interrupt on rising edge */
    GPIO_SetPinInterruptConfig(INIT_DIR_STOP_PIN_ENDSTOP_STICK_GPIO, INIT_DIR_STOP_PIN_ENDSTOP_STICK_PIN, kGPIO_InterruptRisingEdge);

    const port_pin_config_t HOME = {/* Internal pull-down resistor is enabled */
                                    kPORT_PullDown,
                                    /* Low internal pull resistor value is selected. */
                                    kPORT_LowPullResistor,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Passive input filter is disabled */
                                    kPORT_PassiveFilterDisable,
                                    /* Open drain output is disabled */
                                    kPORT_OpenDrainDisable,
                                    /* Low drive strength is configured */
                                    kPORT_LowDriveStrength,
                                    /* Normal drive strength is configured */
                                    kPORT_NormalDriveStrength,
                                    /* Pin is configured as P1_10 */
                                    kPORT_MuxAlt0,
                                    /* Digital input enabled */
                                    kPORT_InputBufferEnable,
                                    /* Digital input is not inverted */
                                    kPORT_InputNormal,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORT1_10 (pin 4) is configured as P1_10 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_HOME_PORT, INIT_DIR_STOP_PIN_HOME_PIN, &HOME);

    const port_pin_config_t SW1 = {/* Internal pull-down resistor is enabled */
                                   kPORT_PullDown,
                                   /* Low internal pull resistor value is selected. */
                                   kPORT_LowPullResistor,
                                   /* Fast slew rate is configured */
                                   kPORT_FastSlewRate,
                                   /* Passive input filter is disabled */
                                   kPORT_PassiveFilterDisable,
                                   /* Open drain output is disabled */
                                   kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   kPORT_LowDriveStrength,
                                   /* Normal drive strength is configured */
                                   kPORT_NormalDriveStrength,
                                   /* Pin is configured as P1_12 */
                                   kPORT_MuxAlt0,
                                   /* Digital input enabled */
                                   kPORT_InputBufferEnable,
                                   /* Digital input is not inverted */
                                   kPORT_InputNormal,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   kPORT_UnlockRegister};
    /* PORT1_12 (pin 6) is configured as P1_12 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_SW1_PORT, INIT_DIR_STOP_PIN_SW1_PIN, &SW1);

    const port_pin_config_t SW2 = {/* Internal pull-down resistor is enabled */
                                   kPORT_PullDown,
                                   /* Low internal pull resistor value is selected. */
                                   kPORT_LowPullResistor,
                                   /* Fast slew rate is configured */
                                   kPORT_FastSlewRate,
                                   /* Passive input filter is disabled */
                                   kPORT_PassiveFilterDisable,
                                   /* Open drain output is disabled */
                                   kPORT_OpenDrainDisable,
                                   /* Low drive strength is configured */
                                   kPORT_LowDriveStrength,
                                   /* Normal drive strength is configured */
                                   kPORT_NormalDriveStrength,
                                   /* Pin is configured as P1_13 */
                                   kPORT_MuxAlt0,
                                   /* Digital input enabled */
                                   kPORT_InputBufferEnable,
                                   /* Digital input is not inverted */
                                   kPORT_InputNormal,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   kPORT_UnlockRegister};
    /* PORT1_13 (pin 7) is configured as P1_13 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_SW2_PORT, INIT_DIR_STOP_PIN_SW2_PIN, &SW2);

    const port_pin_config_t ENDSTOP_AXIS = {/* Internal pull-up/down resistor is disabled */
                                            kPORT_PullDisable,
                                            /* Low internal pull resistor value is selected. */
                                            kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            kPORT_NormalDriveStrength,
                                            /* Pin is configured as P2_12 */
                                            kPORT_MuxAlt0,
                                            /* Digital input enabled */
                                            kPORT_InputBufferEnable,
                                            /* Digital input is not inverted */
                                            kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            kPORT_UnlockRegister};
    /* PORT2_12 (pin 22) is configured as P2_12 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_ENDSTOP_AXIS_PORT, INIT_DIR_STOP_PIN_ENDSTOP_AXIS_PIN, &ENDSTOP_AXIS);

    const port_pin_config_t ENDSTOP_TOWER = {/* Internal pull-up/down resistor is disabled */
                                             kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             kPORT_NormalDriveStrength,
                                             /* Pin is configured as P2_13 */
                                             kPORT_MuxAlt0,
                                             /* Digital input enabled */
                                             kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             kPORT_UnlockRegister};
    /* PORT2_13 (pin 23) is configured as P2_13 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_ENDSTOP_TOWER_PORT, INIT_DIR_STOP_PIN_ENDSTOP_TOWER_PIN, &ENDSTOP_TOWER);

    const port_pin_config_t ENDSTOP_CLEAR = {/* Internal pull-up/down resistor is disabled */
                                             kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             kPORT_NormalDriveStrength,
                                             /* Pin is configured as P2_16 */
                                             kPORT_MuxAlt0,
                                             /* Digital input enabled */
                                             kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             kPORT_UnlockRegister};
    /* PORT2_16 (pin 24) is configured as P2_16 */
    PORT_SetPinConfig(INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_PORT, INIT_DIR_STOP_PIN_ENDSTOP_CLEAR_PIN, &ENDSTOP_CLEAR);

